
#define _CRT_SECURE_NO_WARNINGS
#include "stdafx.h"
#include "Parser.h"
#include "analyzer.h"
#include <iostream>
#include <algorithm>
#include <fstream>
#include <map>
#include <vector>
#include <string>

using namespace std;

/*
Лог_оператор = ">" | "<" | "=" | "&" | "|" | "!" 
Мат_оператор = "+" | "-" | "*" | "/"  | "%"
Цифра = "1" | "2" | "3" | "4" | "5" | "6" | "7" | "8" | "9" | "0" 
Алфавіт = "a" | "b" | "c" | "d" | "e" | "f" | "g" | "h" | "i" | "j" | "k" | "l" | "m" | "n" | "o" | "p" | "q" | "r" | "s" | "t" | "u" | "v" | "w" | "x" | "y" | "z"
Число = {Цифра}
ІД = Алфавіт | "_", {Алфавіт | "_" | Число}
Вираз = {ІД | Число, Мат_оператор}, ІД | Число
Присвоєння = ІД, ("++" | "--") | ( [Мат_оператор], "=", Вираз), ";"
Повернення = "return", Вираз, ";"
Оголошення = Неознач_ІД, ["=", Вираз]
If = "if", "(", Вираз, ")", Команда | "{", {Команда}, "}", ["else", Команда | "{", {Команда}, "}"]
While = "while", "(", Вираз, ")", Команда | "{", {Команда}, "}"
For = "for", "(", Оголошення | Присвоєння, Вираз, Присвоєння без крапки з комою, ")", Команда | "{", {Команда}, "}"
Параметр = Тип, ІД, [ "=", Вираз]
Функція = Тип, Неознач_ІД, "(", {Параметр},  ")", "{", {Команда}, "}"
Команда = Оголошення | If | While | Присвоєння | Повернення
*/

int main()
{
	Parser p("code.txt");
	if (p.c_parse()) {
		Analyzer a(p.code);
		p.print_code();
		cout << endl;
		if (a.is_func(0)) {
			cout << "Everything is OK\n";
		}
	}
	system("pause");
    return 0;
}
